---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTable.Remove(Autodesk.Revit.DB.ExportLinetypeKey)
zh: 删除、移除
source: html/6c6308ee-72aa-0619-cde8-52e413629f36.htm
---
# Autodesk.Revit.DB.ExportLinetypeTable.Remove Method

**中文**: 删除、移除

Removes the pair (key, info) corresponding to the given ExportLinetypeKey.

## Syntax (C#)
```csharp
public void Remove(
	ExportLinetypeKey exportLinetypeKey
)
```

## Parameters
- **exportLinetypeKey** (`Autodesk.Revit.DB.ExportLinetypeKey`) - The export line type key

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null